# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "d12frosted/emacs-plus"

# packages
brew "bash"
brew "cmake"
brew "colima"
brew "curl"
brew "deno"
brew "docker"
brew "emacs-plus@31", args: ["with-savchenkovaleriy-big-sur-curvy-3d-icon"]
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "go"
brew "libtool"
brew "memcached"
brew "node"
brew "npm"
brew "pgformatter"
brew "postgresql"
brew "pyenv"
brew "pyright"
brew "raylib"
brew "ripgrep"
brew "sqlite"
brew "tree-sitter"
brew "typescript"
brew "wget"

# casks
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"

# fonts
cask "font-iosevka"
